perfWettingFiner/case/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }

    front
    {
        type            zeroGradient;
    }

    back
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
    	type            partialSlip;
        valueFraction   uniform #calc"(0.88/(1000.0*60.0))/((0.88/(1000.0*60.0))+(2.0*0.00006))";
        
        //valueFraction   uniform 0.000312402;  //value fraction = d / d+2*lambda, lamba is slip length and d is adjacent mesh cell size        
	/*type            navierSlip;
        value           uniform (0 0 0);
        slipLength      uniform 0.0001;
        wallVelocity    uniform (0 0 0);*/
    }


}

// ************************************************************************* //


